In [4]:
import pandas as pd 
import numpy as np

In [12]:
df = pd.DataFrame({'one': pd.Series(np.random.randn(3) , index = ['a','b','c']),
                   'two': pd.Series(np.random.randn(3) , index = ['a','b','c']),
                   'three': pd.Series(np.random.randn(3) , index = ['a','b','c'])})
row = df.iloc[1]

column = df['two']

In [19]:
df

        one       two     three
a -0.345977  0.305980  1.085464
b -0.741040 -0.708428 -0.527213
c -0.090823  2.438932  0.297201

In [20]:
row

one     -0.741040
two     -0.708428
three   -0.527213
Name: b, dtype: float64

In [21]:
column

a    0.305980
b   -0.708428
c    2.438932
Name: two, dtype: float64

In [22]:
df.sub(row , axis = 'columns')

        one       two     three
a  0.395063  1.014408  1.612677
b  0.000000  0.000000  0.000000
c  0.650217  3.147360  0.824413

In [26]:
df.sub(row , axis = 1 )

        one       two     three
a  0.395063  1.014408  1.612677
b  0.000000  0.000000  0.000000
c  0.650217  3.147360  0.824413

In [28]:
df.sub(column , axis ='index')

        one  two     three
a -0.651957  0.0  0.779484
b -0.032612  0.0  0.181215
c -2.529756  0.0 -2.141732

In [30]:
df.sub(column , axis =0)

        one  two     three
a -0.651957  0.0  0.779484
b -0.032612  0.0  0.181215
c -2.529756  0.0 -2.141732